# Pandas:

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.2.1'

In [3]:
pd?

## Series:

In [16]:
s =pd.Series([12,33,44])

In [17]:
s

0    12
1    33
2    44
dtype: int64

In [18]:
type(s)

pandas.core.series.Series

In [19]:
s.dtype

dtype('int64')

In [20]:
s =pd.Series([12,33,'r',44])

In [21]:
s

0    12
1    33
2     r
3    44
dtype: object

In [23]:
s.dtype

dtype('O')

In [32]:
s =pd.Series([12,33,44,55,66])
s

0    12
1    33
2    44
3    55
4    66
dtype: int64

In [33]:
s.values

array([12, 33, 44, 55, 66], dtype=int64)

In [34]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
s[1]

33

In [36]:
s[1:]

1    33
2    44
3    55
4    66
dtype: int64

In [42]:
s[[4,1]]

4    66
1    33
dtype: int64

In [44]:
s>35

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [40]:
s[s>35]

2    44
3    55
4    66
dtype: int64

In [45]:
s =pd.Series([12,33,44,55,66],index=['a','b','c','d','e'])
s

a    12
b    33
c    44
d    55
e    66
dtype: int64

In [46]:
s.values

array([12, 33, 44, 55, 66], dtype=int64)

In [47]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [48]:
s['a']

12

In [49]:
s[0]

12

In [50]:
s['b':]

b    33
c    44
d    55
e    66
dtype: int64

In [52]:
s[1:3]

b    33
c    44
dtype: int64

In [53]:
s['b':'d']

b    33
c    44
d    55
dtype: int64

In [54]:
s[['e','b']]

e    66
b    33
dtype: int64

In [56]:
s =pd.Series([12,33,44,55,66],index=['c','d','e','a','b'])
s

c    12
d    33
e    44
a    55
b    66
dtype: int64

In [59]:
s['a':'c']

Series([], dtype: int64)

In [170]:
s =pd.Series([12,33,44,55,66],index=['c','a','e','a','b'])
s

c    12
a    33
e    44
a    55
b    66
dtype: int64

In [171]:
s['a']

a    33
a    55
dtype: int64

In [173]:
'b' in s

True

In [174]:
'x' in s

False

In [177]:
s.isin([33])

c    False
a     True
e    False
a    False
b    False
dtype: bool

In [178]:
s[s.isin([33])]

a    33
dtype: int64

In [179]:
s.isin([33,55])

c    False
a     True
e    False
a     True
b    False
dtype: bool

In [180]:
s.isin([33,88])

c    False
a     True
e    False
a    False
b    False
dtype: bool

In [172]:
s**2

c     144
a    1089
e    1936
a    3025
b    4356
dtype: int64

In [80]:
d ={'aditya':33, 'saket':25,'rohan':26,'umar':23}

In [81]:
s =pd.Series(d)
s

aditya    33
saket     25
rohan     26
umar      23
dtype: int64

In [82]:
s.values

array([33, 25, 26, 23], dtype=int64)

In [83]:
s.index

Index(['aditya', 'saket', 'rohan', 'umar'], dtype='object')

In [84]:
s['saket']

25

In [86]:
s =pd.Series({'aditya':33, 'saket':25,'rohan':26,'umar':23},index=['saket','rohan'])
s

saket    25
rohan    26
dtype: int64

In [88]:
s =pd.Series({'aditya':33, 'saket':25,'rohan':26,'umar':23},index=['saket','rohan','blesson'])
s

saket      25.0
rohan      26.0
blesson     NaN
dtype: float64

In [91]:
s.isna()
#s.isnull()

saket      False
rohan      False
blesson     True
dtype: bool

In [94]:
s.notna()
#s.notnull()

saket       True
rohan       True
blesson    False
dtype: bool

In [183]:
s_age= pd.Series([33,26,26,23],index=['Aditya','Saket','Rohan','Umar'])

In [184]:
s_age

Aditya    33
Saket     26
Rohan     26
Umar      23
dtype: int64

In [185]:
s_age[1]

26

In [186]:
s_age.iloc[1]

26

In [187]:
s_age['Saket']

26

In [190]:
s_age.loc['Saket']

26

## DataFrame:

In [103]:
df =pd.DataFrame([[12,34,56],[34,56,77]])
df

    0   1   2
0  12  34  56
1  34  56  77

In [104]:
type(df)

pandas.core.frame.DataFrame

In [105]:
df.dtypes

0    int64
1    int64
2    int64
dtype: object

In [102]:
pd.DataFrame(np.arange(1,13).reshape((3,4)))

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [123]:
df= pd.DataFrame({'name':['aditya','sachin','rahul','virendra'],
             'age':[33,44,32,41],
             'location':['ujjain','mumbai','indore','delhi']})
df

       name  age location
0    aditya   33   ujjain
1    sachin   44   mumbai
2     rahul   32   indore
3  virendra   41    delhi

In [191]:
# s_age = pd.Series({'Aditya':33,'Saket':26,'Rohan':26,'Umar':23})
s_age= pd.Series([33,26,26,23],index=['Aditya','Saket','Rohan','Umar'])

In [192]:
s_age

Aditya    33
Saket     26
Rohan     26
Umar      23
dtype: int64

In [193]:
# s_location = pd.Series({'Aditya':'Indore','Saket':'Bareilly','Rohan':'Madras','Umar':'Ranchi'})
s_location= pd.Series(['Indore','Bareilly','Madras','Ranchi'],index=['Aditya','Saket','Rohan','Umar'])

In [143]:
s_location

Aditya      Indore
Saket     Bareilly
Rohan       Madras
Umar        Ranchi
dtype: object

In [144]:
pd.DataFrame({'age':s_age, 'location':s_location})

        age  location
Aditya   33    Indore
Saket    26  Bareilly
Rohan    26    Madras
Umar     23    Ranchi

In [205]:
s_age= pd.Series([33,26,26,23,45],index=['Aditya','Saket','Rohan','Umar','sachin'])

In [206]:
s_age

Aditya    33
Saket     26
Rohan     26
Umar      23
sachin    45
dtype: int64

In [207]:
s_location= pd.Series(['Indore','Bareilly','Madras','Ranchi','varoda'],index=['Aditya','Saket','Rohan','Umar','rahul'])

In [208]:
s_location

Aditya      Indore
Saket     Bareilly
Rohan       Madras
Umar        Ranchi
rahul       varoda
dtype: object

In [209]:
df=pd.DataFrame({'age':s_age, 'location':s_location})

df

         age  location
Aditya  33.0    Indore
Rohan   26.0    Madras
Saket   26.0  Bareilly
Umar    23.0    Ranchi
rahul    NaN    varoda
sachin  45.0       NaN

In [156]:
df['age']

Aditya    33
Rohan     26
Saket     26
Umar      23
sachin    45
Name: age, dtype: int64

In [157]:
df[['age']]

        age
Aditya   33
Rohan    26
Saket    26
Umar     23
sachin   45

In [169]:
df.loc['Saket']

df.iloc[2]

age               26
location    Bareilly
Name: Saket, dtype: object

In [161]:
df.loc[['Saket']]

df.iloc[[2]]

       age  location
Saket   26  Bareilly

In [162]:
df.loc[['Saket'],['age']]

df.iloc[[2],[0]]

       age
Saket   26

In [164]:
df.loc['Saket','age']

df.iloc[2,0]

26

In [222]:
df =pd.DataFrame(np.random.randint(5,17,(4,4)))
df

    0   1   2   3
0  14   6  10   9
1   9   7  16   5
2   6  15  10  12
3   6  12   5  16

In [223]:
df.iloc[0,0]

14

In [224]:
df.loc[0,0]

14

In [225]:
df.iloc[[2]]

   0   1   2   3
2  6  15  10  12

In [226]:
df.iloc[[3,1]]

   0   1   2   3
3  6  12   5  16
1  9   7  16   5

In [227]:
df.iloc[:,[3,1]]

    3   1
0   9   6
1   5   7
2  12  15
3  16  12

In [228]:
df.iloc[[2],[3,1]]

    3   1
2  12  15

In [230]:
df[df>10]

      0     1     2     3
0  14.0   NaN   NaN   NaN
1   NaN   NaN  16.0   NaN
2   NaN  15.0   NaN  12.0
3   NaN  12.0   NaN  16.0

In [235]:
df

    0   1   2   3
0  14   6  10   9
1   9   7  16   5
2   6  15  10  12
3   6  12   5  16

In [236]:
df[1]>10

0    False
1    False
2     True
3     True
Name: 1, dtype: bool

In [234]:
df[df[1]>10]

   0   1   2   3
2  6  15  10  12
3  6  12   5  16

In [242]:
df.loc[df[1]>10,[2,1]]

    2   1
2  10  15
3   5  12

In [244]:
df= pd.DataFrame({'name':['aditya','sachin','rahul','virendra'],
             'age':[33,44,32,41],
             'location':['ujjain','mumbai','indore','delhi']})
df

       name  age location
0    aditya   33   ujjain
1    sachin   44   mumbai
2     rahul   32   indore
3  virendra   41    delhi

In [245]:
df['age']>40

0    False
1     True
2    False
3     True
Name: age, dtype: bool

In [246]:
df[df['age']>40]

       name  age location
1    sachin   44   mumbai
3  virendra   41    delhi

In [247]:
df.loc[df['age']>40,['age','name']]

   age      name
1   44    sachin
3   41  virendra

In [250]:
df.iloc[:,[1,0]][df['age']>40]

   age      name
1   44    sachin
3   41  virendra

In [8]:
s1 = pd.Series({'adity':33,'sachin':44})

In [9]:
s1

adity     33
sachin    44
dtype: int64

In [10]:
s2 = pd.Series({'adity':33,'sachin':44, 'rahul':35})

In [11]:
s2

adity     33
sachin    44
rahul     35
dtype: int64

In [12]:
s1+s2

adity     66.0
rahul      NaN
sachin    88.0
dtype: float64

In [13]:
df1=pd.DataFrame({'age':[23,56,42]})

In [20]:
df2=pd.DataFrame({'age':[23,56,42]})

In [21]:
df1+df2

   age
0   46
1  112
2   84

In [13]:
df1=pd.DataFrame({'age':[23,56,42]})

In [23]:
df1

   age
0   23
1   56
2   42

In [22]:
df2=pd.DataFrame({'age':[23,56,42]},index=[1,2,3])

In [24]:
df2

   age
1   23
2   56
3   42

In [25]:
df1+df2

    age
0   NaN
1  79.0
2  98.0
3   NaN

In [13]:
df1=pd.DataFrame({'age':[23,56,42]})

In [23]:
df1

   age
0   23
1   56
2   42

In [26]:
df2=pd.DataFrame({'age2':[23,56,42]})

In [27]:
df2

   age2
0    23
1    56
2    42

In [28]:
df1+df2

   age  age2
0  NaN   NaN
1  NaN   NaN
2  NaN   NaN

In [31]:
df= pd.DataFrame({'age':[33,44,32,41],
             'location':['ujjain','mumbai','indore','delhi']},index=['aditya','sachin','rahul','virendra'])
df

          age location
aditya     33   ujjain
sachin     44   mumbai
rahul      32   indore
virendra   41    delhi

In [35]:
df['height']=12

In [36]:
df

          age location  height
aditya     33   ujjain      12
sachin     44   mumbai      12
rahul      32   indore      12
virendra   41    delhi      12

In [47]:
df['height'] = df['age']*4

In [48]:
df

          age location  height
aditya     33   ujjain     132
sachin     44   mumbai     176
rahul      32   indore     128
virendra   41    delhi     164

In [49]:
df['ratio']= df['height']/df['age']

In [50]:
df

          age location  height  ratio
aditya     33   ujjain     132    4.0
sachin     44   mumbai     176    4.0
rahul      32   indore     128    4.0
virendra   41    delhi     164    4.0

In [51]:
# del df['ratio']

df

In [56]:
# df =df.drop('virendra')

df.drop('virendra',inplace=True)
# df.drop('virendra',axis=0, inplace=True)

In [57]:
df

        age location  height
aditya   33   ujjain     132
sachin   44   mumbai     176
rahul    32   indore     128

In [62]:
df.drop('height',axis=1,inplace=True)
# df.drop('height',axis='columns')

In [63]:
df

        age location
aditya   33   ujjain
sachin   44   mumbai
rahul    32   indore

### Handle Missing Value:

In [76]:
# import numpy as np
# pd.Series([12,34,np.nan,56,67])

In [77]:
s = pd.Series([12,34,None,56,67])

In [78]:
s

0    12.0
1    34.0
2     NaN
3    56.0
4    67.0
dtype: float64

In [80]:
# s.isna()
s.isnull()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [82]:
# s.notna()
s.notnull()

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [83]:
s[s.notna()]

0    12.0
1    34.0
3    56.0
4    67.0
dtype: float64

In [84]:
s[s.isna()]

2   NaN
dtype: float64

In [90]:
df = pd.DataFrame([[12,None,34],[56,66,None],[86,99,77],[23,None,53]],index=['a','b','c','d'],columns=['col1','col2','col3'])

In [93]:
df

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [103]:
df.isna()

    col1   col2   col3
a  False   True  False
b  False  False   True
c  False  False  False
d  False   True  False

In [151]:
df.isna().sum()

col1    0
col2    2
col3    1
dtype: int64

In [152]:
df.isna().any()

col1    False
col2     True
col3     True
dtype: bool

In [98]:
# df.notna()

In [100]:
df['col2'].isna()

a     True
b    False
c    False
d     True
Name: col2, dtype: bool

In [102]:
df[df['col3'].notna()]

   col1  col2  col3
a    12   NaN  34.0
c    86  99.0  77.0
d    23   NaN  53.0

#### delete null values:

In [133]:
df

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [134]:
df.dropna()

   col1  col2  col3
c    86  99.0  77.0

In [135]:
df.dropna(axis=1)

   col1
a    12
b    56
c    86
d    23

In [136]:
df.dropna(how='all')

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [113]:
df2 = pd.DataFrame([[12,None,34,None],[56,66,None,None],[86,99,77,None],[23,None,53,None],[None,None,None,None]],index=['a','b','c','d','e'],columns=['col1','col2','col3','col4'])

df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [114]:
df2.dropna(how='all')

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None

In [119]:
df2.dropna(how='all',axis=1)

   col1  col2  col3
a  12.0   NaN  34.0
b  56.0  66.0   NaN
c  86.0  99.0  77.0
d  23.0   NaN  53.0
e   NaN   NaN   NaN

In [137]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [138]:
df2.dropna(thresh=2)

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None

In [128]:
df2.dropna(axis=1, thresh=3)

   col1  col3
a  12.0  34.0
b  56.0   NaN
c  86.0  77.0
d  23.0  53.0
e   NaN   NaN

In [130]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [129]:
df2.dropna(subset=['col3'])

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None

In [132]:
df2.dropna(subset=['col2','col3'])

   col1  col2  col3  col4
c  86.0  99.0  77.0  None

#### fill null values:

In [142]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [144]:
df2.fillna(0)

   col1  col2  col3  col4
a  12.0   0.0  34.0     0
b  56.0  66.0   0.0     0
c  86.0  99.0  77.0     0
d  23.0   0.0  53.0     0
e   0.0   0.0   0.0     0

In [145]:
df2.fillna('X')

   col1  col2  col3 col4
a  12.0     X  34.0    X
b  56.0  66.0     X    X
c  86.0  99.0  77.0    X
d  23.0     X  53.0    X
e     X     X     X    X

In [150]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [149]:
df2['col2'].mean()

82.5

In [154]:
df2['col2'].fillna(df2['col2'].mean())

a    82.5
b    66.0
c    99.0
d    82.5
e    82.5
Name: col2, dtype: float64

In [155]:
df

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [158]:
df.fillna(method='ffill')

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0  34.0
c    86  99.0  77.0
d    23  99.0  53.0

In [159]:
df.fillna(method='bfill')

   col1  col2  col3
a    12  66.0  34.0
b    56  66.0  77.0
c    86  99.0  77.0
d    23   NaN  53.0

In [168]:
df= pd.DataFrame(np.random.randint(5,15,(4,5)))

# df.columns=['c1','c2','c3','c4','c5']

In [169]:
df

    0  1   2   3   4
0  10  7  11   5  10
1  12  6  11  10   5
2   8  5   8  13   7
3  10  5   9  14   8

In [170]:
df + 2

    0  1   2   3   4
0  12  9  13   7  12
1  14  8  13  12   7
2  10  7  10  15   9
3  12  7  11  16  10

In [173]:
s = pd.Series([3,4,5,6,7])

In [174]:
df + s

    0   1   2   3   4
0  13  11  16  11  17
1  15  10  16  16  12
2  11   9  13  19  14
3  13   9  14  20  15

In [188]:
df= pd.DataFrame(np.random.randint(2,10,(4,5)))
df.columns=['c1','c2','c3','c4','c5']

In [189]:
df

   c1  c2  c3  c4  c5
0   2   7   3   6   2
1   8   9   8   5   9
2   4   8   2   4   2
3   6   8   5   8   7

In [190]:
df + s

     c1    c2    c3    c4  c5  c9
0   5.0  11.0   8.0  12.0 NaN NaN
1  11.0  13.0  13.0  11.0 NaN NaN
2   7.0  12.0   7.0  10.0 NaN NaN
3   9.0  12.0  10.0  14.0 NaN NaN

In [191]:
s = pd.Series([3,4,5,6,7], index=['c1','c2','c3','c4','c5'])

In [192]:
df + s

   c1  c2  c3  c4  c5
0   5  11   8  12   9
1  11  13  13  11  16
2   7  12   7  10   9
3   9  12  10  14  14

In [193]:
s = pd.Series([3,4,5,6], index=['c1','c2','c3','c4'])

In [194]:
df + s

     c1    c2    c3    c4  c5
0   5.0  11.0   8.0  12.0 NaN
1  11.0  13.0  13.0  11.0 NaN
2   7.0  12.0   7.0  10.0 NaN
3   9.0  12.0  10.0  14.0 NaN

In [195]:
df

   c1  c2  c3  c4  c5
0   2   7   3   6   2
1   8   9   8   5   9
2   4   8   2   4   2
3   6   8   5   8   7

In [196]:
s

c1    3
c2    4
c3    5
c4    6
dtype: int64

In [197]:
s = pd.Series([3,4,5,6,7], index=['c1','c2','c3','c4','c9'])

In [198]:
df + s

     c1    c2    c3    c4  c5  c9
0   5.0  11.0   8.0  12.0 NaN NaN
1  11.0  13.0  13.0  11.0 NaN NaN
2   7.0  12.0   7.0  10.0 NaN NaN
3   9.0  12.0  10.0  14.0 NaN NaN

In [199]:
df

   c1  c2  c3  c4  c5
0   2   7   3   6   2
1   8   9   8   5   9
2   4   8   2   4   2
3   6   8   5   8   7

In [213]:
# def fun(x):
#     return x.max()

In [218]:
fun_lam = lambda x : x.max()

In [219]:
df.apply(fun_lam)

c1    8
c2    9
c3    8
c4    8
c5    9
dtype: int64

In [222]:
df

   c1  c2  c3  c4  c5
0   2   7   3   6   2
1   8   9   8   5   9
2   4   8   2   4   2
3   6   8   5   8   7

In [223]:
def fun(x):
    if(x<=5):
        return x**2
    else:
        return x

In [225]:
df.applymap(fun)

   c1  c2  c3  c4  c5
0   4   7   9   6   4
1   8   9   8  25   9
2  16   8   4  16   4
3   6   8  25   8   7

#### Sorting:

In [17]:
s = pd.Series(np.random.randint(2,10,6),index=[2,5,1,3,4,6])

In [18]:
s

2    7
5    5
1    7
3    3
4    5
6    9
dtype: int32

In [19]:
s.sort_index()

1    7
2    7
3    3
4    5
5    5
6    9
dtype: int32

In [40]:
s.sort_index(ascending=False)

6    9
5    5
4    5
3    3
2    7
1    7
dtype: int32

In [20]:
s.sort_values()

3    3
5    5
4    5
2    7
1    7
6    9
dtype: int32

In [41]:
s.sort_values(ascending=False)

6    9
2    7
1    7
5    5
4    5
3    3
dtype: int32

In [52]:
df= pd.DataFrame(np.random.randint(2,50,(4,5)))
df.columns=['c6','c3','c2','c4','c5']

In [43]:
df

   c6  c3  c2  c4  c5
0  47  19  26  38  24
1  41  21  43  21  21
2  17  17  13  45  47
3  19  37   7  17  12

In [44]:
df.sort_index()

   c6  c3  c2  c4  c5
0  47  19  26  38  24
1  41  21  43  21  21
2  17  17  13  45  47
3  19  37   7  17  12

In [45]:
df.sort_index(axis=1)

   c2  c3  c4  c5  c6
0  26  19  38  24  47
1  43  21  21  21  41
2  13  17  45  47  17
3   7  37  17  12  19

In [46]:
df.sort_values(by='c5')

   c6  c3  c2  c4  c5
3  19  37   7  17  12
1  41  21  43  21  21
0  47  19  26  38  24
2  17  17  13  45  47

In [47]:
df.sort_values(by=['c2'])

   c6  c3  c2  c4  c5
3  19  37   7  17  12
2  17  17  13  45  47
0  47  19  26  38  24
1  41  21  43  21  21

In [48]:
df.sort_values(by=['c2','c5'])

   c6  c3  c2  c4  c5
3  19  37   7  17  12
2  17  17  13  45  47
0  47  19  26  38  24
1  41  21  43  21  21

In [55]:
s = pd.Series(np.random.randint(2,10,6),index=[2,5,4,3,4,6])

In [56]:
s

2    7
5    2
4    5
3    3
4    2
6    3
dtype: int32

In [57]:
s[4]

4    5
4    2
dtype: int32

In [58]:
s.index.is_unique

False

In [61]:
s = pd.Series(np.random.randint(2,10,6),index=[2,5,4,3,7,6])

In [63]:
s.index.is_unique

True

In [122]:
df= pd.DataFrame([[9,None,4],[37,18,17],[None,35,4],[23,4,12]],columns=['c1','c2','c3'])

In [123]:
# df= pd.DataFrame(np.random.randint(2,50,(250,3)),columns=['c1','c2','c3'])

In [124]:
df

     c1    c2  c3
0   9.0   NaN   4
1  37.0  18.0  17
2   NaN  35.0   4
3  23.0   4.0  12

In [137]:
df.count()

c1    3
c2    3
c3    4
dtype: int64

In [138]:
df['c1'].count()

3

In [125]:
df.sum()

c1    69.0
c2    57.0
c3    37.0
dtype: float64

In [126]:
df.sum(axis=1)

0    13.0
1    72.0
2    39.0
3    39.0
dtype: float64

In [127]:
df.mean()

c1    23.00
c2    19.00
c3     9.25
dtype: float64

In [128]:
df.mean(axis=1)

0     6.5
1    24.0
2    19.5
3    13.0
dtype: float64

In [129]:
df.idxmax()

c1    1
c2    2
c3    1
dtype: int64

In [130]:
df['c1'].argmax()

1

In [131]:
df.idxmin()

c1    0
c2    3
c3    0
dtype: int64

In [132]:
df

     c1    c2  c3
0   9.0   NaN   4
1  37.0  18.0  17
2   NaN  35.0   4
3  23.0   4.0  12

In [133]:
df.cumsum()

     c1    c2  c3
0   9.0   NaN   4
1  46.0  18.0  21
2   NaN  53.0  25
3  69.0  57.0  37

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      3 non-null      float64
 1   c2      3 non-null      float64
 2   c3      4 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

In [135]:
df.describe()

         c1         c2         c3
count   3.0   3.000000   4.000000
mean   23.0  19.000000   9.250000
std    14.0  15.524175   6.396614
min     9.0   4.000000   4.000000
25%    16.0  11.000000   4.000000
50%    23.0  18.000000   8.000000
75%    30.0  26.500000  13.250000
max    37.0  35.000000  17.000000

In [156]:
s=pd.Series([23,55,23,66,14,55,66,88])

In [157]:
s

0    23
1    55
2    23
3    66
4    14
5    55
6    66
7    88
dtype: int64

In [158]:
s.unique()

array([23, 55, 66, 14, 88], dtype=int64)

In [159]:
s.nunique()

5

In [160]:
s.value_counts()

55    2
66    2
23    2
88    1
14    1
dtype: int64

In [161]:
df= pd.DataFrame(np.random.randint(2,7,(10,3)),columns=['c1','c2','c3'])

In [162]:
df

   c1  c2  c3
0   5   5   3
1   5   3   5
2   3   4   2
3   4   5   3
4   4   6   5
5   4   6   5
6   2   4   2
7   4   3   3
8   5   2   5
9   3   5   6

In [167]:
df['c1'].unique()

array([5, 3, 4, 2])

In [168]:
df['c1'].nunique()

4

In [169]:
df['c1'].value_counts()

4    4
5    3
3    2
2    1
Name: c1, dtype: int64

### concatination:

In [220]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [221]:
df1

   c1  c2  c3
0   5   5   5
1   4   2   3
2   2   4   6
3   2   5   4

In [222]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [223]:
df2

   c1  c2  c3
0   3   2   5
1   2   5   6
2   2   5   6
3   5   3   3

In [224]:
pd.concat([df1,df2])

   c1  c2  c3
0   5   5   5
1   4   2   3
2   2   4   6
3   2   5   4
0   3   2   5
1   2   5   6
2   2   5   6
3   5   3   3

In [225]:
pd.concat([df1,df2],axis=1)

   c1  c2  c3  c1  c2  c3
0   5   5   5   3   2   5
1   4   2   3   2   5   6
2   2   4   6   2   5   6
3   2   5   4   5   3   3

In [226]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [227]:
df1

   c1  c2  c3
0   4   5   5
1   4   4   3
2   4   6   2
3   6   5   2

In [228]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c4'])

In [229]:
df2

   c1  c2  c4
0   3   4   4
1   2   4   6
2   3   3   6
3   6   3   4

In [218]:
pd.concat([df1,df2])

   c1  c2   c3   c4
0   4   4  4.0  NaN
1   3   5  3.0  NaN
2   6   3  4.0  NaN
3   6   4  3.0  NaN
0   3   3  NaN  2.0
1   3   3  NaN  6.0
2   5   4  NaN  2.0
3   3   5  NaN  6.0

In [230]:
pd.concat([df1,df2],axis=1)

   c1  c2  c3  c1  c2  c4
0   4   5   5   3   4   4
1   4   4   3   2   4   6
2   4   6   2   3   3   6
3   6   5   2   6   3   4

In [226]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [227]:
df1

   c1  c2  c3
0   4   5   5
1   4   4   3
2   4   6   2
3   6   5   2

In [235]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),index=[0,1,3,4],columns=['c1','c2','c3'])

In [236]:
df2

   c1  c2  c3
0   3   5   5
1   2   5   5
3   5   5   2
4   2   4   5

In [237]:
pd.concat([df1,df2])

   c1  c2  c3
0   4   5   5
1   4   4   3
2   4   6   2
3   6   5   2
0   3   5   5
1   2   5   5
3   5   5   2
4   2   4   5

In [238]:
pd.concat([df1,df2],axis=1)

    c1   c2   c3   c1   c2   c3
0  4.0  5.0  5.0  3.0  5.0  5.0
1  4.0  4.0  3.0  2.0  5.0  5.0
2  4.0  6.0  2.0  NaN  NaN  NaN
3  6.0  5.0  2.0  5.0  5.0  2.0
4  NaN  NaN  NaN  2.0  4.0  5.0

In [239]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [240]:
df1

   c1  c2  c3
0   3   2   3
1   5   2   5
2   4   6   4
3   4   6   6

In [241]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),index=[0,1,3,4],columns=['c1','c2','c4'])

In [242]:
df2

   c1  c2  c4
0   6   5   2
1   4   6   5
3   3   5   2
4   5   2   4

In [243]:
pd.concat([df1,df2])

   c1  c2   c3   c4
0   3   2  3.0  NaN
1   5   2  5.0  NaN
2   4   6  4.0  NaN
3   4   6  6.0  NaN
0   6   5  NaN  2.0
1   4   6  NaN  5.0
3   3   5  NaN  2.0
4   5   2  NaN  4.0

In [244]:
pd.concat([df1,df2],axis=1)

    c1   c2   c3   c1   c2   c4
0  3.0  2.0  3.0  6.0  5.0  2.0
1  5.0  2.0  5.0  4.0  6.0  5.0
2  4.0  6.0  4.0  NaN  NaN  NaN
3  4.0  6.0  6.0  3.0  5.0  2.0
4  NaN  NaN  NaN  5.0  2.0  4.0

##### use inner join in concatination:

In [245]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [246]:
df1

   c1  c2  c3
0   2   6   4
1   6   6   3
2   3   5   6
3   3   6   3

In [247]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [248]:
df2

   c1  c2  c3
0   2   5   6
1   6   4   6
2   3   4   5
3   5   5   6

In [249]:
pd.concat([df1,df2],join='inner')

   c1  c2  c3
0   2   6   4
1   6   6   3
2   3   5   6
3   3   6   3
0   2   5   6
1   6   4   6
2   3   4   5
3   5   5   6

In [250]:
pd.concat([df1,df2],axis=1,join='inner')

   c1  c2  c3  c1  c2  c3
0   2   6   4   2   5   6
1   6   6   3   6   4   6
2   3   5   6   3   4   5
3   3   6   3   5   5   6

In [251]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [252]:
df1

   c1  c2  c3
0   4   6   4
1   3   5   4
2   2   6   3
3   3   3   6

In [253]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c4'])

In [254]:
df2

   c1  c2  c4
0   3   6   2
1   4   6   5
2   2   5   6
3   2   2   2

In [256]:
pd.concat([df1,df2],join='inner')

   c1  c2
0   4   6
1   3   5
2   2   6
3   3   3
0   3   6
1   4   6
2   2   5
3   2   2

In [257]:
pd.concat([df1,df2],axis=1,join='inner')

   c1  c2  c3  c1  c2  c4
0   4   6   4   3   6   2
1   3   5   4   4   6   5
2   2   6   3   2   5   6
3   3   3   6   2   2   2

In [259]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [260]:
df1

   c1  c2  c3
0   4   6   6
1   3   4   4
2   6   4   4
3   6   4   2

In [261]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),index=[0,1,3,4],columns=['c1','c2','c3'])

In [262]:
df2

   c1  c2  c3
0   5   6   4
1   6   4   4
3   4   4   3
4   5   6   6

In [263]:
pd.concat([df1,df2],join='inner')

   c1  c2  c3
0   4   6   6
1   3   4   4
2   6   4   4
3   6   4   2
0   5   6   4
1   6   4   4
3   4   4   3
4   5   6   6

In [265]:
pd.concat([df1,df2],axis=1,join='inner')

   c1  c2  c3  c1  c2  c3
0   4   6   6   5   6   4
1   3   4   4   6   4   4
3   6   4   2   4   4   3

In [259]:
df1= pd.DataFrame(np.random.randint(2,7,(4,3)),columns=['c1','c2','c3'])

In [260]:
df1

   c1  c2  c3
0   4   6   6
1   3   4   4
2   6   4   4
3   6   4   2

In [266]:
df2= pd.DataFrame(np.random.randint(2,7,(4,3)),index=[0,1,3,4],columns=['c1','c2','c4'])

In [267]:
df2

   c1  c2  c4
0   3   5   2
1   6   4   6
3   5   3   6
4   3   5   6

In [269]:
pd.concat([df1,df2],join='inner')

   c1  c2
0   4   6
1   3   4
2   6   4
3   6   4
0   3   5
1   6   4
3   5   3
4   3   5

In [271]:
pd.concat([df1,df2],axis=1,join='inner')

   c1  c2  c3  c1  c2  c4
0   4   6   6   3   5   2
1   3   4   4   6   4   6
3   6   4   2   5   3   6

In [272]:
s1= pd.Series(np.random.randint(2,7,4))

In [277]:
s1

0    2
1    6
2    3
3    5
dtype: int32

In [273]:
s2= pd.Series(np.random.randint(2,7,4))

In [275]:
s2

0    4
1    6
2    4
3    2
dtype: int32

In [278]:
pd.concat([s1,s2])

0    2
1    6
2    3
3    5
0    4
1    6
2    4
3    2
dtype: int32

In [279]:
pd.concat([s1,s2],axis=1)

   0  1
0  2  4
1  6  6
2  3  4
3  5  2

### append:

In [280]:
df1

   c1  c2  c3
0   4   6   6
1   3   4   4
2   6   4   4
3   6   4   2

In [281]:
df2

   c1  c2  c4
0   3   5   2
1   6   4   6
3   5   3   6
4   3   5   6

In [283]:
df1.append(df2)

   c1  c2   c3   c4
0   4   6  6.0  NaN
1   3   4  4.0  NaN
2   6   4  4.0  NaN
3   6   4  2.0  NaN
0   3   5  NaN  2.0
1   6   4  NaN  6.0
3   5   3  NaN  6.0
4   3   5  NaN  6.0

### Merge:

In [295]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [296]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [297]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [305]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [313]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','adi'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR','Engineering']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue','sachin'],
                    'hire_date': [2004, 2008, 2012, 2014,2002]})

In [314]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4      adi  Engineering

In [315]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
4   sachin       2002

##### one-to-one:

In [320]:
df3 = pd.merge(df1,df2)

In [321]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [310]:
pd.merge(df1,df2,how='outer')

  employee        group  hire_date
0      Bob   Accounting     2008.0
1     Jake  Engineering     2012.0
2     Lisa  Engineering     2004.0
3      Sue           HR     2014.0
4      adi  Engineering        NaN
5   sachin          NaN     2002.0

In [311]:
pd.merge(df1,df2,how='left')

  employee        group  hire_date
0      Bob   Accounting     2008.0
1     Jake  Engineering     2012.0
2     Lisa  Engineering     2004.0
3      Sue           HR     2014.0
4      adi  Engineering        NaN

In [312]:
pd.merge(df1,df2,how='right')

  employee        group  hire_date
0     Lisa  Engineering       2004
1      Bob   Accounting       2008
2     Jake  Engineering       2012
3      Sue           HR       2014
4   sachin          NaN       2002

##### one-to-many:

In [322]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [323]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [324]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

##### many-to-many:

In [326]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4      adi  Engineering

In [325]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [327]:
pd.merge(df1,df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      adi  Engineering        coding
7      adi  Engineering         linux
8      Sue           HR  spreadsheets
9      Sue           HR  organization

In [328]:

df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4      adi  Engineering

In [329]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
4   sachin       2002

In [332]:
pd.merge(df1,df2,how='cross')

   employee_x        group employee_y  hire_date
0         Bob   Accounting       Lisa       2004
1         Bob   Accounting        Bob       2008
2         Bob   Accounting       Jake       2012
3         Bob   Accounting        Sue       2014
4         Bob   Accounting     sachin       2002
5        Jake  Engineering       Lisa       2004
6        Jake  Engineering        Bob       2008
7        Jake  Engineering       Jake       2012
8        Jake  Engineering        Sue       2014
9        Jake  Engineering     sachin       2002
10       Lisa  Engineering       Lisa       2004
11       Lisa  Engineering        Bob       2008
12       Lisa  Engineering       Jake       2012
13       Lisa  Engineering        Sue       2014
14       Lisa  Engineering     sachin       2002
15        Sue           HR       Lisa       2004
16        Sue           HR        Bob       2008
17        Sue           HR       Jake       2012
18        Sue           HR        Sue       2014
19        Sue           HR     sachin       2002
20        adi  Engineering       Lisa       2004
21        adi  Engineering        Bob       2008
22        adi  Engineering       Jake       2012
23        adi  Engineering        Sue       2014
24        adi  Engineering     sachin       2002

In [340]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [341]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [342]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [344]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [333]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'name': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [334]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [335]:
df2

   name  hire_date
0  Lisa       2004
1   Bob       2008
2  Jake       2012
3   Sue       2014

In [337]:
# pd.merge(df1,df2)

In [338]:
pd.merge(df1,df2,left_on='employee',right_on='name')

  employee        group  name  hire_date
0      Bob   Accounting   Bob       2008
1     Jake  Engineering  Jake       2012
2     Lisa  Engineering  Lisa       2004
3      Sue           HR   Sue       2014

In [339]:
pd.merge(df1,df2,left_on='employee',right_on='name').drop(columns=['name'])

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [413]:
df_maths= pd.DataFrame({
'student':['adi','rahul','aseem','sachin','sadik'],
'ID':[1,2,3,4,7]}
)

In [414]:
df_science= pd.DataFrame({
'student':['ram','adi','rahul','aseem','sachin'],
'ID':[4,1,2,3,6]}
)

In [406]:
df_maths

  student  ID
0     adi   1
1   rahul   2
2   aseem   3
3  sachin   4
4   sadik   7

In [407]:
df_science

  student  ID
0     ram   4
1     adi   1
2   rahul   2
3   aseem   3
4  sachin   6

In [415]:
pd.merge(df_maths,df_science)

  student  ID
0     adi   1
1   rahul   2
2   aseem   3

In [416]:
pd.merge(df_maths,df_science,on='student')

  student  ID_x  ID_y
0     adi     1     1
1   rahul     2     2
2   aseem     3     3
3  sachin     4     6